Documents/КорректировкаПоказанийПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>КорректировкаПоказанийПриборовУчета</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетПоказанийПриборовУчета</xr:Item>
				<xr:Item>InformationRegister.ПоказанияПриборовУчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Основная</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектУстановки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показание</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказаниеПредыдущее</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказаниеНовое</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказаниеПредыдущееНовое</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/РасчетПоказанийПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетПоказанийПриборовУчета</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КорректировкаПоказаний</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Энергоемкость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ПоказанияПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПоказанияПриборовУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиПоказаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыТарифов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыТарифов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дневной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ночной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пиковый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Общий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСредней</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/КорректировкаПоказанийПриборовУчета/Forms/ФормаДокумента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Функция получает список лицевых счетов из временного хранилища
//
&НаСервере
Процедура ПолучитьЛицевыеСчетаИзХранилища(АдресЛицевыхСчетовВХранилище)
	
	ТаблицаДляЗагрузки	= ПолучитьИзВременногоХранилища(АдресЛицевыхСчетовВХранилище);
	
	МассивОбъектовУстановки = ТаблицаДляЗагрузки.ВыгрузитьКолонку("ЛицевойСчет");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ПоказанияПриборовУчетаСрезПоследних.ВидТарифа, ЗНАЧЕНИЕ(Перечисление.ВидыТарифов.Общий)) КАК ВидТарифа,
		|	ЕСТЬNULL(ПоказанияПриборовУчетаСрезПоследних.Значение, 0) КАК Показание,
		|	ЕСТЬNULL(ПоказанияПриборовУчетаСрезПоследнихПред.Значение, 0) КАК ПоказаниеПредыдущее,
		|	РасчетПоказанийПриборовУчета.ОбъектУстановки,
		|	РасчетПоказанийПриборовУчета.ПриборУчета,
		|	РасчетПоказанийПриборовУчета.Услуга,
		|	ЕСТЬNULL(ПоказанияПриборовУчетаСрезПоследних.Значение, 0) КАК ПоказаниеНовое,
		|	ЕСТЬNULL(ПоказанияПриборовУчетаСрезПоследнихПред.Значение, 0) КАК ПоказаниеПредыдущееНовое,
		|	РасчетПоказанийПриборовУчета.ПриборУчета.Коэффициент КАК Коэффициент
		|ИЗ
		|	РегистрНакопления.РасчетПоказанийПриборовУчета КАК РасчетПоказанийПриборовУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(&ДатаОкончания, ) КАК ПоказанияПриборовУчетаСрезПоследних
		|		ПО РасчетПоказанийПриборовУчета.ПриборУчета = ПоказанияПриборовУчетаСрезПоследних.ПриборУчета
		|			И РасчетПоказанийПриборовУчета.ВидТарифа = ПоказанияПриборовУчетаСрезПоследних.ВидТарифа
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(&ДатаНачала, ) КАК ПоказанияПриборовУчетаСрезПоследнихПред
		|		ПО РасчетПоказанийПриборовУчета.ПриборУчета = ПоказанияПриборовУчетаСрезПоследнихПред.ПриборУчета
		|			И РасчетПоказанийПриборовУчета.ВидТарифа = ПоказанияПриборовУчетаСрезПоследнихПред.ВидТарифа
		|ГДЕ
		|	РасчетПоказанийПриборовУчета.Период >= &ДатаНачала
		|	И РасчетПоказанийПриборовУчета.Период <= &ДатаОкончания
		|	И РасчетПоказанийПриборовУчета.Услуга = &Услуга
		|	И РасчетПоказанийПриборовУчета.ОбъектУстановки В(&ОбъектыУстановки)
		|	И РасчетПоказанийПриборовУчета.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|	И РасчетПоказанийПриборовУчета.Регистратор <> &Ссылка";
	
	Запрос.Параметры.Вставить("ДатаНачала", НачалоМесяца(Объект.ПериодНачисления));
	Запрос.Параметры.Вставить("ДатаОкончания", КонецМесяца(Объект.ПериодНачисления));
	
	Запрос.Параметры.Вставить("ОбъектыУстановки", МассивОбъектовУстановки);
	Запрос.Параметры.Вставить("Услуга", Объект.Услуга);
	
	Запрос.Параметры.Вставить("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Объект.Основная.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // ПолучитьЛицевыеСчетаИзХранилища()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОСМДСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		СостояниеДокумента,
		КартинкаСостоянияДокумента,
		РазрешеноПроведение,
		ПоследнееИзменение,
		Параметры.ЗначенияЗаполнения);
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ПериодНачисления = КонецМесяца(ДобавитьМесяц(ТекущаяДата(),-1));
	КонецЕсли;
	
	ФорматнаяСтрока = "ru = ""Л=ru;ДФ='MMMM yyyy'""; uk = ""Л=uk;ДФ='MMMM yyyy'""";
	ОтображениеПериодаНачисления = Формат(ЭтаФорма.Объект.ПериодНачисления, НСтр(ФорматнаяСтрока));
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Объект.Основная.Очистить();
	КонецЕсли;
	
	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ДополнительныеОтчетыИОбработки
	
	Локализация.ПриСозданииНаСервере(ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОСМДКлиент.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение, ПоследнееИзменение);
	
КонецПроцедуры

// Процедура - обработчик события ПриЧтенииНаСервере.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);

КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода "ПериодНачисления".
//
&НаКлиенте
Процедура ОтображениеПериодаНачисленияПриИзменении(Элемент)
	
	ЭтаФорма.Объект.ПериодНачисления 		= КонецМесяца(ЭтаФорма.Объект.ПериодНачисления);
	ФорматнаяСтрока = "ru = ""Л=ru;ДФ='MMMM yyyy'""; uk = ""Л=uk;ДФ='MMMM yyyy'""";
	ЭтаФорма.ОтображениеПериодаНачисления 	= Формат(ЭтаФорма.Объект.ПериодНачисления, НСтр(ФорматнаяСтрока));
	
КонецПроцедуры

// Процедура - обработчик события НачалоВыбора поля ввода "ПериодНачисления".
//
&НаКлиенте
Процедура ОтображениеПериодаНачисленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЭтаФорма.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Основная.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Перед изменением периода табличная часть будет очищена. Продолжить?';uk='Перед зміною періоду таблична частина буде очищена. Продовжити?'"),
		                      РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		Объект.Основная.Очистить();
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура("ДатаКалендаря", ?(ЭтаФорма.Объект.ПериодНачисления= Дата('00010101'), ТекущаяДата(), ЭтаФорма.Объект.ПериодНачисления));
	ДатаКалендаряНачало = ОткрытьФормуМодально("ОбщаяФорма.ФормаКалендаря", СтруктураПараметров);
	
	ЭтаФорма.Объект.ПериодНачисления = КонецДня(ДатаКалендаряНачало);
	
	ОтображениеПериодаНачисленияПриИзменении(Элемент);
	
КонецПроцедуры

// Процедура - обработчик события Регулирование поля ввода "ПериодНачисления".
//
&НаКлиенте
Процедура ОтображениеПериодаНачисленияРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	Если ЭтаФорма.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Основная.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Перед изменением периода табличная часть будет очищена. Продолжить?';uk='Перед зміною періоду таблична частина буде очищена. Продовжити?'"),
		                      РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		Объект.Основная.Очистить();
	КонецЕсли;
	
	ЭтаФорма.Объект.ПериодНачисления = ?(ЗначениеЗаполнено(ЭтаФорма.Объект.ПериодНачисления), 
						ДобавитьМесяц(ЭтаФорма.Объект.ПериодНачисления, Направление),
						ДобавитьМесяц(КонецМесяца(ТекущаяДата()), Направление));
						
	ОтображениеПериодаНачисленияПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.Основная.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Перед заполнением табличная часть будет очищена. Продолжить?';uk='Перед заповненням таблична частина буде очищена. Продовжити?'"),
		                      РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		Объект.Основная.Очистить();
	КонецЕсли;
	
	
	ПараметрыЗаполнения = Новый Структура;
	
	ПараметрыЗаполнения.Вставить("ДатаНачала",		НачалоМесяца(Объект.ПериодНачисления));
	ПараметрыЗаполнения.Вставить("ДатаОкончания",	КонецМесяца(Объект.ПериодНачисления));
	ПараметрыЗаполнения.Вставить("ОтборОрганизация",	Объект.Организация);
	ПараметрыЗаполнения.Вставить("ОтборЗдание",			Объект.Здание);
	
	АдресЛицевыхСчетовВХранилище = ОткрытьФормуМодально("ОбщаяФорма.ФормаПодбораЛицевыхСчетов", ПараметрыЗаполнения);
	
	Если ЗначениеЗаполнено(АдресЛицевыхСчетовВХранилище) Тогда
		
		ПолучитьЛицевыеСчетаИзХранилища(АдресЛицевыхСчетовВХранилище);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновнаяПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
КонецПроцедуры
